data/cfdb/validation/turbulent_flat_plate/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Inlet turbulence: intensity I = 5% of U_inf = 10 m/s
//   k_inlet = 1.5 * (I * U_inf)^2 = 1.5 * (0.05 * 10)^2 = 0.375 m^2/s^2
// (kept consistent with omega via mixingLength = 0.01 m, see 0/omega).

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }
    outlet
    {
        type            zeroGradient;
    }
    plate
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
    top
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
