data/cfdb/validation/turbulent_flat_plate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         2000;

deltaT          1;

writeControl    timeStep;

writeInterval   500;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    // Wall shear stress on the plate: raw material for the Cf QoI,
    // Cf(x) = tau_w(x) / (0.5 * rho * U_inf^2), rho = 1 for this
    // incompressible setup.
    wallShearStress_plate
    {
        type            wallShearStress;
        libs            ("libfieldFunctionObjects.so");
        patches         (plate);
        writeControl    writeTime;
    }
    // y+ on the plate at write times: lets a run verify the wall-function
    // y+ ~ 30 target declared in constant/polyMesh/blockMeshDict.
    yPlus_plate
    {
        type            yPlus;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
    }
}

// ************************************************************************* //
